// 9.	Вывести на экран четные числа от 1 до N

System.Console.Write("Введите число num: ");
int num = Convert.ToInt32(Console.ReadLine());

int i = 1;

while (i <= num)
{
    System.Console.Write(i);
    i++;
}